{
  "sightings": [
    {
      "YEAR": "Early 1990's",
      "SEASON": "Fall",
      "STATE": "Alaska",
      "COUNTY": "Valdez-Chitina-Whittier County",
      "LOCATION_DETAILS": "East side of Prince William Sound",
      "OBSERVED": "Ed L. was salmon fishing with a companion in Prince William Sound. After anchoring off shore, his companion took a small boat up a river to check on the state of the salmon run. As the day wore on toward evening and he didn't come back at the expected time, Ed scanned upriver and across the adjacent land with binoculars. There he saw a sasquatch walking across the tundra, with long, smooth steps and with dark hair flowing from its shoulders, bouncing behind \"like a cape\" at every step. The sasquatch paid no attention to the boat (distance about 1,000').",
      "OTHER_WITNESSES": "On a commercial fishing boat at anchor at the mouth of one of the rivers discharging into the bay.",
      "TIME_AND_CONDITIONS": "Early Fall, in the early 1990's.",
      "REPORT_NUMBER": "1261",
      "REPORT_CLASS": "Class A"
    },
    {
      "REPORT_NUMBER": null,
      "REPORT_CLASS": null
    },
    {
      "YEAR": "2000",
      "SEASON": "Fall",
      "MONTH": "September",
      "DATE": "2nd or 3rd",
      "STATE": "New Jersey",
      "COUNTY": "Warren County",
      "LOCATION_DETAILS": "the road is off us rt 80, i dont know the exit number just how to get there if im driving will try to find out the details.",
      "NEAREST_TOWN": "Allumuchy",
      "NEAREST_ROAD": "not sure of the road",
      "OBSERVED": "heh i kinda feel a little dumb that im reporting this but its bothering me so here goes.. bout a month ago i was with a friend and her son, we were hanging out at a camp ground by Allamuchy state park, in Warren county NJ. i think the camp ground was part of Stephens state park either way it was on the Musconetcong river. it was late in the day and we were just walking on the trials by the river. we figured since her son was gonna stay with her folks that evening we would come back later and spend the night at the camp ground. we went home and got together some gear, just sleeping bags and sleeping pads. we stopped at a store got some hotdogs and rolls and a gallon of water then headed to the camp site. it was about 10pm when we got to the camp site and i think we took spot 19. it was close to the road one of the last spots before ya hit the road maybe 50 yards or so. we made a fire in the metal fire ring and just sat around till about 1am, there were maybe 5 or 6 sites that were camped that night one was taken by some boy scouts. at about 1am my friend got in her sleeping bag next to the fire, i was still up drinking hot chocolate and stareing into the fire, about 20min or so later i got into my bag next to her and was lieing on my side looking into the woods. i wasnt comfortable and i laid awake for a good hour or so just thinking and listening to the sounds of the woods and the river that was 100yards tops away from me. then i heard a sound like someone was lightly banging a fork or something against a plate. i thought maybe a bear was snooping around looking for a free meal, this is bear country and we have a very healthy black bear population, but maybe 30 seconds after i heard the metalic sound i heard someone or something bang a branch against a tree 4 or 5 times in a row, i thought that the bear maybe was getting a little to close to someones camp site. then i again heard banging against a tree but this time it was a bout 100yards into the woods and not near any camping area that i had seen in the daylight. then the tree banging came from the first spot as if answering the other position. the first tree banger was what seemed to be on or near the road by the middle of the camp ground. that kinda made my mind wander i was wondering what was going on..and who is up making all this noise. about 10minutes later i looked into the woods which were slightly iluminated by my dieing fire and i saw what looked like a bear looking into my camp about 20 feet away from behind a tree. i saw just the shadowy outline of it. i could see its head and shoulders slowly move out from behind the tree look in and then move back behind the tree. ive seen bears do this before in the day light but never this close. then i closed my eyes waited a few seconds and opened them just to make sure i wasnt seeing things. but this whatever it was had difined shoulders and a rounded kinda pointy on top head, it didnt have and ears like you would see on a bear, nor the flat head of a bear and if it was a bear its front arms wouldnt have given it the squared off shoulders that i was seeing in the silloette of this figure. i got kinda scared for a few moments and didnt move a at all. i thought for a second about jumping up and yelling at it but i didnt want so get it mad at me or scare it. i closed my eyes and tried my hardest just to fall asleep. i dozed off finally and was awoken by my friend who was yelling at me for not putting the bag of hotdogs in the car before going to sleep. we had in the bag a apple and a orange, rolls and a unopend pack of hotdogs, i tied the bag with a simple knot like you would tigh your shoes the night before, but when i got up the only thing left where the bag was, was the orange just sitting there on the ground. my friend said somthing along the lines of wow a bear came and stole our hotdogs. i kinda was wondering what was going on so i decided to have a look around where i saw the figure the night before, i remembered that the shadowy figure was hiding behind the tree and i could see a branch just above its head maybe a foot or so higher than the top of the figure. it was puzzleing because that branch must have been 8 or 9 feet off the ground and black bears where i come from dont stand that tall on there hind feet. i didnt try to tell her what i heard or saw the night before because she wouldnt have belived me anyway, but ive spend lots of time in the back country and woods hunting, fishing, rock climbing, and backpacking. i know what bears look like up close as well as from a distance. and this wasnt a bear and to tall for a person. i didnt smell anything but i think i was up wind anyway and we were burning wood in the fire and all i could really smell was the fire anyway. the thing that really bothers me is the tree banging its was allmost like something was comunicating with something else. it also bothers me that something waited until it was sure that i was asleep before coming into camp. in which case it woulda been 6 or 7 feet from where we were sleeping in order to open the bag and have a look in it, then disguard the orange and take the rest bag and all. it wouldve had to make some sound if it just tore the bag opened. i looked around before we left to see if i could find any tracks or anything but the ground is was just to hard, there was a few game trails but i didnt look very far or spend alot of time looking. i looked on the internet and found this sight and was surprized to see other sitings in new jersey.",
      "ALSO_NOTICED": "nothing",
      "OTHER_WITNESSES": "my friend was asleep, and i was lying next to the fire just listening to the sounds of the woods and river.",
      "OTHER_STORIES": "no but after the events stated i looked at you web site and found other sightings in sussex county.",
      "TIME_AND_CONDITIONS": "lighting was from a camp fire that was dieing you could see shadows and tree pretty clear from 30 to 40 feet. clear sky, stars were out no clouds.",
      "ENVIRONMENT": "good size river, steep hills, very rugged area, Saxton Falls is just down stream of the camp ground and across the road is a set a cliffs commonly used for rock climbers. it is very easy to get lost in this area and supports bear, deer, foxes as well as allmost all other animals native to new jersey. miles of back country and farms, as well as old mines and lime kilns.",
      "REPORT_NUMBER": "438",
      "REPORT_CLASS": "Class B"
    },
    {
      "YEAR": "2016",
      "SEASON": "Summer",
      "MONTH": "June",
      "DATE": "7",
      "STATE": "New Hampshire",
      "COUNTY": "Sullivan County",
      "LOCATION_DETAILS": "Close to Claremont down 120 not far from Kingston road.",
      "NEAREST_TOWN": "Claremont",
      "NEAREST_ROAD": "Rte 120",
      "OBSERVED": "I was on my way to Claremont from Lebanon on Rte 120 and was passing by some reeds in a marshy area next to the road that sounded like a huge flock of birds. The creature came out of the reeds and was crouched down looking at me through them. Surprisingly it got out of the reeds from crouched to standing turned around and ran towards the wooded area up a hill and was moving with it's arms brush and tree branches out of the way. It was incredibly fast runner and I got a good look at its coconut shaped head as it ran away. It was light brown/brown. It had incredibly broad shoulders. I went back the same day. The marsh went up to my knees and I could smell a bad odor like garbage. Myself and a friend went back to the sighting. We found a footprint and a hair sample. I could hear wood knocks when my friend James did a call and we also found a large bed of branches and some tree structures. The following month I went back to Claremont and I heard screeching in the woods while I was traveling Rte. 120 on a bicycle.",
      "OTHER_WITNESSES": "Just myself",
      "TIME_AND_CONDITIONS": "5am. Dawn. Clear weather",
      "ENVIRONMENT": "swamp with forest behind it. There was a large tree that fell behind where I spotted the squatch that actually looked like a place to sleep almost.",
      "REPORT_NUMBER": "55269",
      "REPORT_CLASS": "Class A"
    },
    {
      "YEAR": "2018",
      "SEASON": "Spring",
      "MONTH": "May",
      "DATE": "25",
      "STATE": "Nebraska",
      "COUNTY": "Thurston County",
      "LOCATION_DETAILS": "Latitude & Longitude :  42.158230  -96.344197",
      "NEAREST_TOWN": "Macy",
      "NEAREST_ROAD": "Highway 201",
      "OBSERVED": "I was northeast of Macy Nebraska along the Missouri River taking part in an expedition hosted by members of the Omaha Indian tribe. We were on the Omaha Reservation.  These tribal members say they've had many sightings in the hilly bluff zone extending for miles along the west flank of the Missouri River Basin. Five of us had decided to take a day hike to see a possible “X” structure. As we started up the path it became known that to get to the “X” we’d have to veer off the main path and bushwhack through the weeds. Two people did this while three of us decided to stay on the clearer but muddy path. (I still have never seen this \"X\" but pictures are available.) As we headed up the trail one of my Native American companions said he was hearing movement in the woods to our right. At this point we could not see very far off the path as trees and brush blocked the view. I did not hear the movement. We continued forward and came to an area where trees had been cut down in the past. We could see maybe 40-50 yards back into the forest. Two of us looked to our right as soon as we made it to this clearer area and immediately saw movement. I saw a long light brown object that was swinging downward from a horizontal position toward. It was not indicative of any other animal that I can think of and was bent slightly at an apparent elbow. I could not see a hand because of the brush. At the time of the sighting the other witness started telling us what HE just saw. He said “I just saw one” and described seeing the whole upper body of a light brown Sasquatch. Apparently when it noticed us it started to drop down and move to its right (our left) behind cover. He said as it was ducking down the arm had swung way up in the air and back down, and he demonstrated. His description and demonstration exactly matched what I had seen. He did not know that I had also seen it as he was telling me his story. I took a picture of the area where the sighting happened. This subject was behind and to the right of a stick pointing upward. On July 27th 2018, I revisited the location with BFRO investigator T. Bell and hacked my way back into this spot. We determined that the top of the stick is about 11 feet high, making the top of the swinging ‘arm’ at around 9 feet tall. On the day of the sighting I was not prepared to bushwhack back into the site where the subject was seen. I was better prepared when we returned on July 27th. I have already done an interview with the BFRO investigator just after our recreation attempt. This subject was MUCH larger than me. It could very easily be 10 + feet as it was already ducking away when I saw it.",
      "ALSO_NOTICED": "I had audio recorders set up in the area and recorded possible vocalizations the following morning at around 5 am.",
      "OTHER_WITNESSES": "2 witnesses saw the creature. 3 people were present.",
      "OTHER_STORIES": "There are MANY encounters in this general area including a long distance daytime sighting just yesterday (July 28th). The proud Native people of this area seemingly tend to keep their stories within their own community. I am very blessed to have been able to hear the details of many of these encounters.",
      "TIME_AND_CONDITIONS": "1:35 pm on a clear and very hot sunny day. Temperature was above 90 degrees at the time.",
      "ENVIRONMENT": "This is a heavily forested area bordering the Missouri River. Lots of hills, ravines, and trees.",
      "REPORT_NUMBER": "59757",
      "REPORT_CLASS": "Class B"
    }
  ]
}
